Documents/ЛБ_РеестрПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РеестрПлатежей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_РаспределенныеБезналичныеПлатежи</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеРеестраПлатежей</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_БезналичныеПлатежиКРаспределению</xr:Item>
				<xr:Item>InformationRegister.ЛБ_РеестрБезначныхПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлатежиБН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОЗаемщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОПлательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлатежиЛК</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_РеестрБезначныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеестрБезначныхПлатежей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОЗаемщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаСотрудникомЦО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОборотыПоОперациямЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОборотыПоОперациямЗайма</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплатыПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплатыЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаБлокировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Comment>Залоговый билет</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеРеестраПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеРеестраПлатежей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлатежей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлатежейРаспределить</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусРеестра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыРеестраПлатежей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыБезналичныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыБезналичныхПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетыйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныйКабинет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыРеестраПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыРеестраПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Загружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_РеестрПлатежей/Ext/ObjectModule.bsl
Перем ПроверятьНаличиеПлатежей Экспорт;

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если НЕ ЭтотОбъект.Проведен Тогда 
		ПроверятьНаличиеПлатежей = Истина;
	Иначе    
		ПроверятьНаличиеПлатежей = Ложь;
	КонецЕсли;	     
КонецПроцедуры // ПередЗаписью()

Функция ПроверитьПлатежБН(НомерРеестра, НомерПП, ДатаПлатежа, НомерЗБ)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("НомерРеестра", НомерРеестра);
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);  
	Запрос.УстановитьПараметр("НомерПП", НомерПП);
    Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.СтатусПлатежа КАК СтатусПлатежа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей.СрезПоследних(
	               |			&Дата,
	               |			РеестрПлатежей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет)
	               |				И ДатаПлатежа = &ДатаПлатежа
	               |				И ИдентификаторПлатежа = &НомерПП
	               |				И НомерЗБ = &НомерЗБ) КАК ЛБ_РеестрБезначныхПлатежейСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Период УБЫВ"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда   
		Если Выборка.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен Тогда
			Возврат Истина;
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;	
    Возврат Истина;
КонецФункции  

Функция ПроверитьПлатежЛК(НомерРеестра, Идентификатор, ДатаПлатежа, НомерЗБ)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("НомерРеестра", НомерРеестра);
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);  
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
    Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.СтатусПлатежа КАК СтатусПлатежа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей.СрезПоследних(
	               |			&Дата,
	               |			РеестрПлатежей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет)
	               |				И ДатаПлатежа = &ДатаПлатежа
	               |				И ИдентификаторПлатежа = &Идентификатор
	               |				И НомерЗБ = &НомерЗБ) КАК ЛБ_РеестрБезначныхПлатежейСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Период УБЫВ"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда   
		Если Выборка.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен Тогда
			Возврат Истина;
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;	
    Возврат Истина;
КонецФункции  

Функция ПроверитьЕстьОплатыКасса(ДатаПлатежа, ЗалоговыйБилет) 
	Возврат ЛБ_ОбщийМодуль.ПроверитьЕстьОплатыКасса(ЭтотОбъект.ВидОперации, Дата, ДатаПлатежа, ЗалоговыйБилет);
КонецФункции

Функция ПроверитьЕстьОплатыБН(ДатаПлатежа, ЗалоговыйБилет) 
	Возврат ЛБ_ОбщийМодуль.ПроверитьЕстьОплатыБН(ДатаПлатежа, ЗалоговыйБилет);
КонецФункции

Функция ПроверитьПоФИО(Клиент, ФИОЗаемщика, ФИОПлательщика)
	Если НЕ ПустаяСтрока(ФИОЗаемщика) ИЛИ НЕ ПустаяСтрока(ФИОПлательщика) Тогда 
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Дата", Дата); 
		Запрос.УстановитьПараметр("Клиент", Клиент);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
		               |ИЗ
		               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда      
			ВсеОК = Истина;
			Если НЕ ПустаяСтрока(ФИОЗаемщика) Тогда  				
				Если Найти(Врег(ФИОЗаемщика), Врег(Выборка.Фамилия)) = 0 Тогда
					ВсеОК = ложь;
				Иначе
					Если Найти(Врег(ФИОЗаемщика), Врег(Выборка.Имя)) = 0 Тогда
						ВсеОК = ложь;    
					ИначеЕсли НЕ ПустаяСтрока(Выборка.Отчество) Тогда
						Если Найти(Врег(ФИОЗаемщика), Врег(Выборка.Отчество)) = 0 Тогда
						    ВсеОК = ложь;    
                        КонецЕсли;
					КонецЕсли;	
				КонецЕсли;	
				Если ВсеОК Тогда
					Возврат Истина;
				КонецЕсли;   
			КонецЕсли;	
			Если НЕ ПустаяСтрока(ФИОПлательщика) Тогда  
				Если Найти(Врег(ФИОПлательщика), Врег(Выборка.Фамилия)) = 0 Тогда
					Возврат ложь;;
				Иначе
					Если Найти(Врег(ФИОПлательщика), Врег(Выборка.Имя)) = 0 Тогда
						Возврат ложь;    
					ИначеЕсли НЕ ПустаяСтрока(Выборка.Отчество) Тогда
						Если Найти(Врег(ФИОПлательщика), Врег(Выборка.Отчество)) = 0 Тогда
						    Возврат ложь;   
                        КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			Иначе	
				Возврат Ложь;
			КонецЕсли;	
			Возврат Истина;
		Иначе     
			Возврат Ложь;
		КонецЕсли;	
	Иначе  
		Возврат Ложь;
	КонецЕсли;	
КонецФункции 

Функция КоличествоПлатежейПоЗБ(ДатаПлатежа, ЗалоговыйБилет) 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("ДатаПлатежа", НачалоДня(ДатаПлатежа)); 
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	СУММА(ВЫБОР
	                |			КОГДА ЛБ_ОборотыПоОперациямЗайма.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)
	                |				ТОГДА 1
	                |			ИНАЧЕ -1
	                |		КОНЕЦ) КАК Количество
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	                |ГДЕ
	                |	НЕ ЛБ_ОборотыПоОперациямЗайма.РеестрПлатежей = ЗНАЧЕНИЕ(Документ.ЛБ_РеестрПлатежей.ПустаяСсылка)
	                |	И ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = &ЗалоговыйБилет
	                |	И ЛБ_ОборотыПоОперациямЗайма.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	                |	И ЛБ_ОборотыПоОперациямЗайма.РеестрПлатежей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет)
	                |	И НАЧАЛОПЕРИОДА(ЛБ_ОборотыПоОперациямЗайма.Период, ДЕНЬ) = &ДатаПлатежа
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;	
	Возврат 0;
КонецФункции	


// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_СостояниеРеестраПлатежей.Записывать = Истина;
	Движения.ЛБ_РеестрБезначныхПлатежей.Записывать = Истина;  
	Движения.ЛБ_БезналичныеПлатежиКРаспределению.Записывать = Истина;
	Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Записывать = Истина;
	
	Если  ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет Тогда 
		
		СуммаПлатежейРаспределить = 0;
		Для каждого Стр Из ЭтотОбъект.ПлатежиЛК Цикл  
			Если ПроверятьНаличиеПлатежей Тогда
				Если НЕ ПроверитьПлатежЛК(ЭтотОбъект.НомерРеестра, стр.ИдентификаторПлатежа, стр.ДатаПлатежа, стр.НомерЗБ) Тогда
					Продолжить;
				КонецЕсли; 
			КонецЕсли;	  
			
			СуммаПлатежейРаспределить = СуммаПлатежейРаспределить + стр.СуммаПлатежа;
			
			Движение = Движения.ЛБ_РеестрБезначныхПлатежей.Добавить();
			Движение.Период = Дата; 
			Движение.РеестрПлатежей = ЭтотОбъект.Ссылка;
			Движение.ДатаПлатежа = Стр.ДатаПлатежа;
			Движение.ИдентификаторПлатежа = стр.ИдентификаторПлатежа;
			Движение.НомерЗБ = Стр.НомерЗБ;
			Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			Движение.СуммаПлатежа = стр.СуммаПлатежа;   
			//+МАН 25.04.25 Добавлен новый реквизит. Заявка 3043
			Движение.СпособПлатежа = стр.СпособПлатежа;
			//-МАН
			СуммаПереплаты = 0;
			Если НЕ ЗначениеЗаполнено(Стр.ЗалоговыйБилет) Тогда
			    Движение.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДляВозврата;
			Иначе    
				СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Дата, Стр.ЗалоговыйБилет); 
				Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ 
					 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение ИЛИ 
					 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления ИЛИ 
					 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда   
					Движение.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДляВозврата;
					СуммаПереплаты = Стр.СуммаПлатежа;  
				ИначеЕсли ПроверитьЕстьОплатыКасса(Стр.ДатаПлатежа, Стр.ЗалоговыйБилет) Тогда
					Движение.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДляВозврата;
					СуммаПереплаты = Стр.СуммаПлатежа; 
				ИначеЕсли ПроверитьЕстьОплатыБН(Стр.ДатаПлатежа, Стр.ЗалоговыйБилет) Тогда	 
					Движение.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДляВозврата;
					СуммаПереплаты = Стр.СуммаПлатежа; 
				Иначе 
					РезультатРасчета = ЛБ_Общиймодуль.ПроверитьРасчетыПоЗалоговомуБилету(Стр.ДатаПлатежа, Стр.ЗалоговыйБилет);
					Если РезультатРасчета.ОстатокПроценты > 0 Тогда
					    Движение.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КЗачислению;
						//СуммаПереплаты = ?(РезультатРасчета.ОстатокПроценты >= Стр.СуммаПлатежа, 0, Стр.СуммаПлатежа-РезультатРасчета.ОстатокПроценты);
					Иначе 
						Движение.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДляВозврата;
						СуммаПереплаты = Стр.СуммаПлатежа;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;     
			Если НЕ СуммаПереплаты = 0 Тогда
			    Движение.Переплата = СуммаПереплаты;
				
				ДвижениеПереплата = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
				ДвижениеПереплата.Период = Дата;
				ДвижениеПереплата.ДатаПлатежа = стр.ДатаПлатежа;
				ДвижениеПереплата.ЗалоговыйБилет = стр.ЗалоговыйБилет;
				ДвижениеПереплата.ИдентификаторПлатежа = Стр.ИдентификаторПлатежа;
				ДвижениеПереплата.НомерЗБ = Стр.НомерЗБ;
				ДвижениеПереплата.РеестрПлатежей = ЭтотОбъект.Ссылка;
				ДвижениеПереплата.СуммаПлатежа = стр.СуммаПлатежа;
				ДвижениеПереплата.Переплата = СуммаПереплаты; 
			КонецЕсли;	
			
			Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьПриход();
		    Движение.Период = Дата;   
			Движение.РеестрПлатежей = ЭтотОбъект.Ссылка;
			Движение.ДатаПлатежа = Стр.ДатаПлатежа;
			Движение.ИдентификаторПлатежа = стр.ИдентификаторПлатежа;
			Движение.НомерЗБ = Стр.НомерЗБ;
			Движение.СуммаПлатежа = стр.СуммаПлатежа;
            Движение.Сумма = стр.СуммаПлатежа;
			
		КонецЦикла;  
		
		Движение = Движения.ЛБ_СостояниеРеестраПлатежей.Добавить();
		Движение.Период = Дата;
		Движение.РеестрПлатежей = ЭтотОбъект.Ссылка;
		Движение.СтатусРеестра = Перечисления.ЛБ_СтатусыРеестраПлатежей.Загружен;
		Движение.СуммаПлатежей = ЭтотОбъект.ПлатежиЛК.Итог("СуммаПлатежа"); 
		Движение.СуммаПлатежейРаспределить = СуммаПлатежейРаспределить;
		Движение.Ответственный = ЭтотОбъект.Ответственный;
		
	ИначеЕсли  ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
		
		СуммаПлатежейРаспределить = 0;
		Для каждого Стр Из ЭтотОбъект.ПлатежиБН Цикл 
			Если ПроверятьНаличиеПлатежей Тогда
				Если НЕ ПроверитьПлатежБН(ЭтотОбъект.НомерРеестра, Стр.НомерПП, Стр.ДатаПлатежа, Стр.НомерЗБ) Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			
			СуммаПлатежейРаспределить = СуммаПлатежейРаспределить + стр.СуммаПлатежа;

			Движение = Движения.ЛБ_РеестрБезначныхПлатежей.Добавить();
			Движение.Период = Дата; 
			Движение.РеестрПлатежей = ЭтотОбъект.Ссылка;
			Движение.ДатаПлатежа = Стр.ДатаПлатежа;
			Движение.ИдентификаторПлатежа = стр.НомерПП;
			Движение.НомерЗБ = Стр.НомерЗБ;
			Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			Движение.СуммаПлатежа = стр.СуммаПлатежа;     
			
			РезультатЛК = ЛБ_ОбщийМодуль.ПроверитьЕстьПлатежиЛКДляОтмены(КонецДня(Стр.ДатаПлатежа), Стр.ЗалоговыйБилет); 
			СуммаПереплаты = 0;
			Если НЕ ЗначениеЗаполнено(Стр.ЗалоговыйБилет) Тогда 				
			    Движение.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДляРазбора;
			Иначе   
				ДляРазбора = Ложь;
				Если НЕ ПроверитьПоФИО(Стр.ЗалоговыйБилет.Залогодатель, Стр.ФИОЗаемщика, Стр.ФИОПлательщика) Тогда  
					ДляРазбора = Истина;
				КонецЕсли;	                                                                              
				СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Дата, Стр.ЗалоговыйБилет); 
				Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ 
					 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение ИЛИ   
					 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления ИЛИ
					 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда   
					ДляРазбора = ?(ДляРазбора, ДляРазбора, Истина);
					СуммаПереплаты = Стр.СуммаПлатежа;  
				ИначеЕсли ПроверитьЕстьОплатыКасса(КонецДня(Стр.ДатаПлатежа), Стр.ЗалоговыйБилет) Тогда
					ДляРазбора = ?(ДляРазбора, ДляРазбора, Истина);
					СуммаПереплаты = Стр.СуммаПлатежа;	
				ИначеЕсли ПроверитьЕстьОплатыБН(КонецДня(Стр.ДатаПлатежа)-9+КоличествоПлатежейПоЗБ(Стр.ДатаПлатежа, Стр.ЗалоговыйБилет), Стр.ЗалоговыйБилет) Тогда	 
					ДляРазбора = ?(ДляРазбора, ДляРазбора, Истина);
					СуммаПереплаты = Стр.СуммаПлатежа;	
				Иначе           
					РезультатРасчета = ЛБ_Общиймодуль.ПроверитьРасчетыПоЗалоговомуБилету(КонецДня(Стр.ДатаПлатежа), Стр.ЗалоговыйБилет);
					Если (РезультатРасчета.ОстатокПроценты + РезультатРасчета.ОстатокЗайм) > 0 Тогда   
						Если НЕ РезультатЛК.Количество() = 0 Тогда  
							Для каждого СтрЛК Из РезультатЛК Цикл
							    Если СтрЛК.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено ИЛИ
									 СтрЛК.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда
									ДляРазбора = ?(ДляРазбора, ДляРазбора, Истина); 
									СуммаПереплаты = Стр.СуммаПлатежа;
								ИначеЕсли НЕ ЗначениеЗаполнено(СтрЛК.ДокументОплаты) Тогда  
									ДляРазбора = ?(ДляРазбора, ДляРазбора, Истина);
									СуммаПереплаты = Стр.СуммаПлатежа;   
								ИначеЕсли СтрЛК.СтатусПереплаты = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено ИЛИ
									      СтрЛК.СтатусПереплаты = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда  
									ДляРазбора = ?(ДляРазбора, ДляРазбора, Истина);
									СуммаПереплаты = Стр.СуммаПлатежа;	
								КонецЕсли;	
							КонецЦикла;	
						КонецЕсли;
					Иначе
						ДляРазбора = ?(ДляРазбора, ДляРазбора, Истина);
					    СуммаПереплаты = Стр.СуммаПлатежа;	
					КонецЕсли; 
				КонецЕсли;   
				Если ДляРазбора Тогда 
					Движение.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДляРазбора;
				Иначе
					Движение.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КЗачислению;
				КонецЕсли;	
			КонецЕсли;     
			Если НЕ СуммаПереплаты = 0 Тогда
			    Движение.Переплата = СуммаПереплаты; 
				
				ДвижениеПереплата = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
				ДвижениеПереплата.Период = Дата;
				ДвижениеПереплата.ДатаПлатежа = стр.ДатаПлатежа;
				ДвижениеПереплата.ЗалоговыйБилет = стр.ЗалоговыйБилет;
				ДвижениеПереплата.ИдентификаторПлатежа = Стр.НомерПП;
				ДвижениеПереплата.НомерЗБ = Стр.НомерЗБ;
				ДвижениеПереплата.РеестрПлатежей = ЭтотОбъект.Ссылка;
				ДвижениеПереплата.СуммаПлатежа = стр.СуммаПлатежа;
				ДвижениеПереплата.Переплата = СуммаПереплаты; 
			КонецЕсли;
			Движение.ФИОЗаемщика = Стр.ФИОЗаемщика;
			Движение.ФИОПлательщика = Стр.ФИОПлательщика;  
			
			Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьПриход();
		    Движение.Период = Дата;   
			Движение.РеестрПлатежей = ЭтотОбъект.Ссылка;
			Движение.ДатаПлатежа = Стр.ДатаПлатежа;
			Движение.ИдентификаторПлатежа = стр.НомерПП;
			Движение.НомерЗБ = Стр.НомерЗБ;
			Движение.СуммаПлатежа = стр.СуммаПлатежа;
            Движение.Сумма = стр.СуммаПлатежа;
		КонецЦикла;  
		
		Движение = Движения.ЛБ_СостояниеРеестраПлатежей.Добавить();
		Движение.Период = Дата;
		Движение.РеестрПлатежей = ЭтотОбъект.Ссылка;
		Движение.СтатусРеестра = Перечисления.ЛБ_СтатусыРеестраПлатежей.Загружен;
		Движение.СуммаПлатежей = ЭтотОбъект.ПлатежиБН.Итог("СуммаПлатежа");  
		Движение.СуммаПлатежейРаспределить = СуммаПлатежейРаспределить;
		Движение.Ответственный = ЭтотОбъект.Ответственный;
		
	КонецЕсли;	
КонецПроцедуры
